[
  {
    "title": "Hanging planter",
    "author": "jd_maybe",
    "score": 4,
    "text": "Made this for Mother’s Day. Had enough to make three. Cute little thing and sold an unfinished one for $50 on marketplace. Finally justifying the $1000+ in tools I’ve acquired over the last year."
  },
  {
    "title": "Help with wood movement",
    "author": "No-Lavishness6942",
    "score": 3,
    "text": "I posted this question with photos of my finished cutting board and didn't get any answers, so posting again.  \nI made an end grain cutting board. The wood had all been in my shop for weeks or months before use. I ended up with two issues.\n\n1. The board cupped after glue up, so I ran it through the timesaver to flatten it. A week later it was cupped again, just slightly. See the cut off slice photo - what would cause this? The board itself only cupped a little 1/16\" but still an issue. (ignore the gap, had a little snipe I had to cut off the end of this piece.)\n2. I used the same glue in all the glue ups. Titebond III. During final sanding, I wet it down (quite wet) several times to raise the grain. Sanded to 320 - glass smooth. After washing the first time and drying, I could feel just slightly many of the joints from the second to last and last glue ups. So not the five pieces into a square, but the squares into a long-grain piece then the final end-grain glue up. What would cause this? It didn't feel as if one side of the joint was proud, almost as if the glue swelled and was just slightly proud. Again, not too big a deal, my wife won't ever notice, but I notice every single time I touch it.\n\nhttps://preview.redd.it/tgckl0qwik0f1.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=f31d494b3eeeb50b02bcaca396c94b32f849a41e"
  },
  {
    "title": "Does anyone have any tips on how to clamp these smaller parts to the long ends of these boards?",
    "author": "NumberWnn",
    "score": 1,
    "text": "I’m trying to glue/clamp small parts onto the long edges of some boards, but I’m struggling to keep them in place. Any tips or techniques that might help?\n\n"
  },
  {
    "title": "Miter saw kickback, is it a thing?",
    "author": "SilverHelp74",
    "score": 7,
    "text": "I was reading another post about table saws and kick back and someone commented that they have only had kickback on the miter saw.  I didn't  know this was a thing, how does it happen and how do you keep it from happening, I'm new to all this and just got a miter saw and don't have a tablesaw yet."
  },
  {
    "title": "How square is square enough",
    "author": "RelationNegative1362",
    "score": 1,
    "text": "I am a hobbies woodworker, who is only using handtools. I have gotten pretty good at squaring stock using a hand plane, but I can never seem to get it perfect. Are there any techniques that you would recommend or is perfection not the goal but close enough?"
  },
  {
    "title": "Am I able to make this cut on my white oak using my table saw? Or should I use a guide + circular saw?",
    "author": "wRXLuthor",
    "score": 2,
    "text": "I need to trim 3 of these panels so that the final dimension is 17 3/8” wide by 17 1/8 long. As pictured I would be cutting the board to go from 17.5” (upper section) and 18.125” (lower section) to both be cut to 17 3/8” wide. I understand that you aren’t supposed to crosscut stock that is wider than it is long but the hard part is I need it to be fairly accurate to make these white oak shelves. This pice is too big for my crosscut sled otherwise I would use that. \n\nI have a kreg rip cut guide and if that’s safer than I’ll sacrifice accuracy for safety of course. "
  },
  {
    "title": "How to square these end grain warped wooden blanks",
    "author": "UnusualBox7947",
    "score": 1,
    "text": "I have some wooden strips and am wondering how would you get rid of the warp on them? They’re roughly 15”x1.5”x1.5” (small height difference). I plan to turn them into a cutting board if possible and am struggling to get them to form a seamless gap. I can’t think of any ways or find any that are safe.\n\nI’m in a shop where most tools are available except for a bandsaw or anything else I think can help.\n\nIf you’re able to provide some insight it would be great."
  },
  {
    "title": "Looking for info on this folding table",
    "author": "floxnair",
    "score": 3,
    "text": "Does anyone recognize this style of folding tray table? I’m just curious if there’s a name for this design. I got this from my grandmothers house and have never seen a design like it before. The hinge is especially unique and oddly proportioned.  I’m guessing it could be from the 40’s or 50’s but there are no identifying marks or badges on it. Thanks for any info you can provide "
  },
  {
    "title": "Shop vac dust collector recommendation",
    "author": "poopypoopX",
    "score": 1,
    "text": "So i finally decided to start doing something about dust. I got into this for home remodeling and my fist projects were all like re-doing pantries or building planters. I built a white oak microwave stand too . I only had a miter saw and a circular saw and I would just work outside.  So at my new place I've done a built in shelving unit and some laundry room cabinets. Once again, mostly outside. But then I went to learn how to do raised panel cabinet doors and bought a router table, table saw etc. I built a table saw cart, miter saw station, and a router table standNow I'm making some fucking dust ! So I went down to rockler and got the power tool shop vac kit and got one of those kreg separators for a 5 gallon bucket.  Bought a new sander with dust hookup.  I was feeling good.  So yesterday I'm building the cabinet doors aaaaand the rigid shop vac burnt out.  So, I need another wet dry for the household. Should I get another rigid or is another brand better.  Also, should I continue using a shop vac for quick dust collection or should I buy something dedicated. I have all the typical concerns : space, not wanting to spend a fortune, easy to move from tool to tool. What have you all been pleased with?"
  },
  {
    "title": "Useful, sentimental project ideas",
    "author": "Pasadena1994",
    "score": 1,
    "text": "My grandmother passed away last year and my grandfather recently reunited with her, they were together just shy of 70 years. While going through the estate, I found a piece of pine my grandfather had carved their names into. It looked like a practice piece. As I've been getting more into woodworking, I wanted to clean it up and return it to my dad.\n  \nThe piece of carved pine is a 1x4 and ~17\" long.\n  \nI was wondering what you all thought might be a good little project piece I could incorporate it into so it doesn't become clutter. My only real idea so far has been to put into a shelving unit similar to the picture I added. A bench was another idea, but that might be a lot to transport 500+ kilometers with a hatchback. Thanks in advance."
  },
  {
    "title": "Can anyone help me with random orbital sander issues and maybe some explanations",
    "author": "Stormz_",
    "score": 0,
    "text": "So I posted in the cutting boards subreddit recently asking for help with an end grain walnut board where every time my sander crossed over where I had just sanded, like the crossover in a Venn diagram, I was getting lines. It wasn’t an issue from what lowers grits as every time I’d sand new lines would only appear where I’d just sanded. \n\nI tried everything people suggested, went down the grits then back up, water popped, little to no pressure, moving nice and slow. Tried it all with no luck. Just now as a last ditch effort to see if I could make anything work I just tried moving the sander way quicker and in big circles instead of just slow in straight lines and results are way way better, I’m not getting these lines anymore. \n\nCan anyone please explain what’s going on? I followed all the advice that gets passed around and couldn’t get the results I wanted and yet when I threw it all out the window it somehow worked? Is it a skill issue on my part when I’m following conventional advice, is it the sander itself? Last pieces of info is the sander is a cheap, €43, Mac Allister random orbital, bought it in the hope I could start making some money to eventually invents in better tools as money is tight right now. The lines I’m talking about are circled in blue, I’m aware there are also swirl marks on the board, I had just tried a lower speed on the sander to see if that would help just before taking the pics. \n\nAny feedback would be great, thanks "
  },
  {
    "title": "UF Gators Cuttingboard",
    "author": "alwaysonthebolts",
    "score": 5,
    "text": "Cousin has his 30th birthday this past weekend and asked for a cutting board with the gators logo on it. Made this out of cherry, measures in at 12x18x1.25”"
  },
  {
    "title": "Zen garden box, hand tools only. I still need to make the tools but I'm happy with this.",
    "author": "Perkinstein",
    "score": 87,
    "text": "The box is made of walnut and soft maple with a plywood bottom. Legs are sassafras. Lid is bookmached walnut and white oak. "
  },
  {
    "title": "Noises coming from chop saw when any pressure is applied to the chop/timber… any ideas?",
    "author": "Suspicious-Ad-8931",
    "score": 1,
    "text": "Lf1000 makita saw… brand new blade… any thoughts…!? Video below:\n\nhttps://youtube.com/shorts/hiOHMUyw9Nk?si=b8c9-_hJtLfyyXEs"
  },
  {
    "title": "Hiring tools?",
    "author": "wereheretobeus",
    "score": 3,
    "text": "I am at the point I'm starting to need more tools, at the moment specifically an orbital sander and an electric planer. \nIs hiring tools worth it for a couple of jobs or is it best to buy a mid range tools? \n\nWhat's you're experiences with hiring vs buying, particularly in the UK? \n"
  },
  {
    "title": "Wood lamp",
    "author": "Portugalquinta",
    "score": 6,
    "text": ""
  },
  {
    "title": "Side table",
    "author": "Portugalquinta",
    "score": 3,
    "text": "Make a side table to my livingroom "
  },
  {
    "title": "Small coffee table",
    "author": "Portugalquinta",
    "score": 10,
    "text": "Coffee table with pine wood "
  },
  {
    "title": "DW734 Planer at my Home Depot (St.  Peters MO) for $222 (YMMV)",
    "author": "Ladewig",
    "score": 4,
    "text": "I was at my Home Depot (St. Peters MO, 63304) yesterday and picked up a DW734 planer for $222. I was just browsing and spotted the yellow tag. They had one on the shelf, and it came home with me. Current online price is $528.99.\n\nHad been keeping an eye on FBM for a used planer but jumped on this to get a new unit with warranty.\n\nhttps://preview.redd.it/rjdesz51ji0f1.jpg?width=1977&amp;format=pjpg&amp;auto=webp&amp;s=6b886ad7bb702fca49728594c9c1d0c592bb9d3f\n\n"
  },
  {
    "title": "Are there any metric plans?",
    "author": "viloniousgit",
    "score": 2,
    "text": "Hi, I feel a bit dumb! I've finally got my first bit of kit (circular saw, drill set, speed squares and work bench) and have searched for simple beginner plans. I've found quite a few sites and seen amazing projects but they are all in US Imperial and I'm not sure if I can simply convert them to metric and round down/up. Ideally I want to try and find plans that are in metric but I keep on failing with my google searching.\n\nDoes anyone here have any links I can follow that provide plans in metric, or should I just simply convert imperial -&gt; metric and keep it simple?\n\nThanks in advance from a poor Brit who feels overwhelmed!"
  },
  {
    "title": "Can this splitting wood be repaired? I’d like to use it for a desk.",
    "author": "FungusBrewer",
    "score": 5,
    "text": "Hi there, I have some old wood that’s been in my basement for around 50 years (I think). \n\nIs there a way to repair these cracks through the board? I’m trying to make a Murphy Desk out of what’s on hand. Was thinking clamps with glue? Maybe some kind of “stitching”? \n\nOr is this a solid “don’t do it”? \n\nThank you! \n\n "
  },
  {
    "title": "Best way to restore this wooden Starrett punch container?",
    "author": "gryponyx",
    "score": 3,
    "text": "Advice on restoring this wooden Starrett center punch storage container?"
  },
  {
    "title": "Cat (litter box) Credenza",
    "author": "jakeingrambarnard",
    "score": 17,
    "text": "My first commission ! A very posh and challenging cabinet for a cat little box. The doweling isn’t a moving tambour due to them having it in a corner . Glad with how it turned out!"
  },
  {
    "title": "Buy or Pass Delta 28-243x",
    "author": "idunlkkwanrmlld",
    "score": 5,
    "text": "\n\nI’ve been out of college for about a year and need a band saw to go with my lathe so that I can keep up woodworking in my home shop. Struggling between buying a new band saw or finding one used. I found this post for 600$ but i can’t tell if it’s a good deal or not, could someone help me figure this out? It would be primarily for cutting blanks out of slabs I chainsawed, and cutting up scraps into little trinkets. Any opinion would be valued and appreciated!!\n\nThe guy said it’s 15 years old and that the only issue he’s had is with the lower blade pressure bearing (I don’t know what that means)"
  },
  {
    "title": "Hemlock raised garden bed",
    "author": "kilodelta22",
    "score": 41,
    "text": "Put this together this week out of 2x8 hemlock! Had to mill down my spare to make the top trim but came out pretty good."
  },
  {
    "title": "Help with plywood cuts",
    "author": "PlasticThoughts",
    "score": 2,
    "text": "I’m not sure how to make these cuts given the odd angles? Should I use a jigsaw with some type of straight edge to hold the straight lines?\n"
  },
  {
    "title": "Cedar 2x4x8 Drying",
    "author": "Handsofevil",
    "score": 1,
    "text": "Hey Reddit, bought a stack of Red Cedar 2x4x8 to replace an on-ground garden in our back yard and had a question about dry time before applying a clear sealant. It's from the hardware store so it's cut and processed, but definitely can tell it still retains a bit of moisture. I've got it in the garage with plenty of space between the boards with a fan on them and I live in a thankfully fairly dry area. Without fully buying a moisture meter, any tips for how long they should dry and how to check?"
  },
  {
    "title": "Is there any way to fix or improve the imperfections?",
    "author": "InfiniteAdagio8844",
    "score": 1,
    "text": "I’m making my dad Steve Ramsey’s drill bit organizer for Father’s Day and I love the way it’s coming out. But got a little rough with the sanding the lid doesn’t sit flush. Is there any way to fix this? Run it through the planer? Use a hand plane? Just leave it?  Also there is a tiny gap around the lid that is kindve bugging me. Would a cherry colored wood filler help correct this?"
  },
  {
    "title": "How do I make a 45 degree angle?",
    "author": "GabbyLouSue",
    "score": 1,
    "text": "Hello! I’m building a garden box for the corner of my property. How can I make a 45 degree angle? I have a circular saw and wood but don’t have the know how. Thanks!"
  },
  {
    "title": "Help with sizing my new workbench",
    "author": "TheOverthinkingMaker",
    "score": 2,
    "text": "Im going to be building a version of RexKruger's english joiners bench as my first real workbench.\nMy issue is that due to space constraints im going to be shortening and thinning the dimensions a bit. So instead of of the original that is 24\" by 60\",I planned on making mine at 16\" by 48\".\nMy issue is that I feel like these dimensions are gonna make the bench feel too thin and wobbly. Is it just me overthinking it a bit or is there some math reason these dimensions dont work out? Please any advice is welcome :)"
  },
  {
    "title": "Can anyone help me identify the wood of this hangar?",
    "author": "jackboiyaa",
    "score": 3,
    "text": "I need to make 5 of these and I'm doing a CNC project, but I'm not sure what type of wood this hangar is. Its from a antique chest. "
  },
  {
    "title": "Saw Another, So Posting My Own Sofa Table (console table)",
    "author": "Chuckler3",
    "score": 16,
    "text": "Saw some post up theirs, so figured I'd do the same. 3rd slab table.. still learning the joinery side of things, but have been derailed after hurricane Milton. Pictures are out of order because reddit doesn't care in which order I select them apparently."
  },
  {
    "title": "Table Saw Kickback Scare - Need Safety Advice",
    "author": "AllyInCourt",
    "score": 2,
    "text": "Hey everyone,\n\nHad my first (and hopefully last) table saw kickback today. Seriously think my regular glasses saved my eye. It was my first time back at the saw in four years (just finished school), and I was excited to finally have time to build a little bunny toolbox for my niece's first birthday. Now I'm pretty freaked out.\n\nThe irony? I was *trying* to build a table saw sled for safety! I was making a 30-degree angle cut on a 6.5\" long 2x4 (for a handle) and it shot backwards. I was pushing it with another longer 2x4 on top, between the blade and the fence. The piece is gone somewhere in my garage.\n\nSo, what now? How can I make my table saw safer? I'm hesitant to go back out there. Is it okay for a beginner to build a simple sled/jig using just a 2x4 and plywood with my zero-play miter bars (instead of complex angled plans)? Or are there affordable pre-made safety solutions I should consider? What other safety measures are crucial (like feather boards)?\n\nAny advice would be hugely appreciated. Woodworking is my stress relief, and I don't want this fear to make me quit."
  },
  {
    "title": "Fixing old chair arm ?",
    "author": "Strict-Path-9601",
    "score": 3,
    "text": "Hi, I picked up four of these chairs for free, and am just starting to figure out how to restore them to a usable state, or if it is even possible. This chair is the worst of the lot, one of the arms has come loose, and is cracked. Any advice ? \nNot sure if it would be better to attempt to disassemble completely or to attempt clamping / glueing. I'll add that the screws in the chair are quite rusty. "
  },
  {
    "title": "Upgrading my drill press",
    "author": "Former_Height6600",
    "score": 1,
    "text": "I purchased a yard sale drill press about fifteen years ago for $25.  \n\nI have a chance to upgrade to  a used RYOBI bench top 10\"drill press  with a Rockler table kit for $50.\n\nComments?\n\nRamblinReck"
  },
  {
    "title": "Looking for suggestions:",
    "author": "Big_Strawberry_7339",
    "score": 20,
    "text": "I made these flight boards for my wife for Mother's Day.  I used a 2\" forstner bit which left an indent I filled with wood filler.  \n\nI haven't put any oil on these to finish them, and am wondering if I should use a countersink to take out the food filler, then pop in a plug to make it look cleaner before oil.  \n\nIf the answer to that is 'yes', what would be the way to sand down the plug?  Rotary tool with a sandpaper bit?"
  },
  {
    "title": "Lumber yards in north atlanta?",
    "author": "BeefFlankSteak2",
    "score": 1,
    "text": "Where are good places to get quality wood in north atlanta, specifically the gwinnett area? Thanks in advance"
  },
  {
    "title": "Wokrbench Advice - Mounting an OLD Table Saw",
    "author": "Ted_E_Bayer",
    "score": 0,
    "text": "https://preview.redd.it/6xf10wouve0f1.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=8defae902f2b3a71c6bd9e8efed8a0c07c45ac1a\n\nI've been getting into some small woodworking projects after buying my first home and am looking to build a 4x6 workbench on castors for my single-car garage. I've been slowly acquiring some nice tools, including a mitre saw, chisels and hand saws, and some nice Dewalt and Ryobi used power tools\n\nWell... I've just inherited this (photo) awesome table saw and stand from my grandfather in-law, fully covered in rust and pits. I've spent the last two weeks refurbishing it and I'm proud of where it's at, but I'm getting sick of working on the floor and want to build my first workbench. I've seen some awesome builds on YouTube where you can build your table saws and/or mitre saws into the bench, and I'd like to try that (at least with the table saw).\n\n**Question is:** *does anyone have some tips for building this into my workbench, and how do I best extend the fence rails for it?* The fence on it is OLD with no positive stops or measurement and unfortunately the bars it clips too are too short to rip full sheets of plywood to anything wider than about 12', but I want to go bigger for some built-in closet shelves I've drawn up. I was curious if anyone has any ideas for better rails or extending the ones I currently have, considering I'm still a newcomer to the hobby. \n\nThanks in advance for the help!\n\n**TL;DR** \\- Looking to mount this old table saw with an external motor to a workbench and looking for table construction advice, as well as ways to either extend the rails for full plywood sheets, or adding new ones with better measurment and stops. Thanks!"
  },
  {
    "title": "Question: 3 Way Lap Joint",
    "author": "VegetableRatio2692",
    "score": 5,
    "text": "Hi folks,\nApologies if this seems to be a silly question.\nI’m going to be building a loft bed soon, was wondering if you guys can give me some input. I’m curious as to how I can drill and screw to reinforce the corners without the screws hitting one another. Is it just that the screws are short enough?\n"
  },
  {
    "title": "Mother’s Day gift for my wife",
    "author": "batdad098",
    "score": 18,
    "text": "Project I did out of African mahogany finished with linseed oil and lined with pictures of my wife and three daughters (2 new ones).  Please ignore the background my basement is messy lol "
  },
  {
    "title": "Outdoors miter joint dowel and screw",
    "author": "tommy-55",
    "score": 0,
    "text": "I am replacing a rotted border around a 5' square fountain with 5/4 x 6 oak boards I had available. The in ground portion is lined with rubber roofing that overlaps the shallow block wall forming the border. This new framework is decorative and rests on the rubber so thrre is no soil contact.\n\nI plan to use 3/8 double dowels (red) with titebond III glue. I thought I would pull the joints tight with one or two 1/8 x 1/4 timber screws. Is it better to screw perpendicular to the miter as shown or maybe straight in fron tge board edge?"
  },
  {
    "title": "Looking for advice",
    "author": "NeckPrudent4063",
    "score": 1,
    "text": "Hey everyone, I just completed my first woodworking project a TV console for myself. I’m preparing to sand this down for primer and paint and I just had a couple of questions.I was just wondering, what is the best way to get rid of this squeezed out of dried up wood glue? What grit should I send this down to for the smoothest finish possible? Should I send it in between layers of primer and paint? And what kind of brushes/ rollers should I use for primer and paint? Any other tips for a smooth finish would be helpful too!! Thanks for all the help guys!! "
  },
  {
    "title": "Looking for a birdhouse type project to help teach tool uses and safety to a spouse.",
    "author": "X18GamerYT",
    "score": 1,
    "text": "Hello!\n\nI’m looking for ideas on small scale projects, ideally something that only a couple hours to complete similar to a bird house. I’m trying to introduce woodworking to my significant other, as she enjoys building things with me. She’s expressed some interest in trying woodworking, but I think she finds the table saw and other tools to be intimidating. Any suggestions for a project like this would be great. "
  },
  {
    "title": "Tips for jumping to lumber from actual lumber yards and not box stores",
    "author": "Bombboy85",
    "score": 17,
    "text": "I’m curious what you all learned in the process of buying and milling actual good wood from real lumber yards and not box stores.\n\nI want to do it but anytime I’ve tried joining and planing spare pieces of wood for practice, I’ve failed miserably. I have access to a wood shop that is pay by the hour and has tons of equipment. Every time I’ve ever tried to plane something I can’t get it flat, it ends up thinner on one end than the other so of course that isn’t going to plane correctly. \n\nSo because of this I have stuck with buying the flattest straightest boards I can from box store and rolling with it but of course in time it warps and bends because it’s not dried out properly etc. I have projects I want to try but the milling process is holding me back "
  },
  {
    "title": "Simple putt putt game!",
    "author": "pdpflux",
    "score": 7,
    "text": "First project with my new WEN 9” bandsaw! Built this mini putting game using less than half a 2x4, resawed it down to 3/4” boards (main reason I got a bandsaw). Was on the fence about getting a bandsaw for months, but wow… totally worth it. Smooth cuts, satisfying curves, and now I’ve got a fun little golf challenge with three archways and a surprising amount of difficulty. Openings are 3”, 4-1/2” (official golf cup diameter) and 5”, and they need to be at least 2” high to clear a golf ball (1.68”).\n\nHighly recommend a bandsaw for small shop projects like this—game-changer!"
  },
  {
    "title": "Best solution for repairing a dining table top",
    "author": "Pocacan",
    "score": 1,
    "text": "Long story short, we got a table that we were told was solid wood and it turns out it’s very heavy duty composite wood with veneer. Still like the table, but we’re trying to figure out the best way to restore it. Here’s the situation:\n\n-several areas on the top have bubbled up from water, but the veneer has not chipped or separated from the particle board\n\n-there’s lots of other surface stains like paint splotches, foggy spots from water, scratches, etc.\n\nWe really want to avoid having to go in, separate the veneer, and smooth it out. That’s more of an ordeal than I’d like to take on.\n\nInstead, I’d like to hack it all to pieces and sand it flat then fill in the gaps where particle board shows through. What’s the best materials to use for this? Also, what’s the best solution to fixing the surface stains and spots?"
  },
  {
    "title": "Reclaimed wood for a small coffee table",
    "author": "civilward",
    "score": 9,
    "text": "Had some pallet wood and some old wood from the side of my house. Wanted a little coffee table that would work for my low to the ground chair. Not perfect by any means but learned a ton doing it. Can't wait to start the next one!"
  },
  {
    "title": "Playing with some scraps and learning to bend wood.",
    "author": "Ok_Guide_8323",
    "score": 341,
    "text": "I had some strips of red oak leftover and decided to try to make a DNA double helix. I built a steam box, but I found that steam bending the wood often resulted in some splitting as my radius of curvature was a bit too short. I combined steam bending with kerf bending to get the bends that I was looking for. Hopefully, this can be part of a plant stand."
  },
  {
    "title": "In need of advice",
    "author": "omgkk-banx",
    "score": 2,
    "text": "How hard would a project like this be for someone with 0 experience? What are your favorite accounts/channels posting techniques and methods?"
  },
  {
    "title": "Made some cutting boards from a butcher block top off cut",
    "author": "Rubes27",
    "score": 3,
    "text": "I built a coffee bar in the kitchen and used. Butcher block top from Lowe’s. I ended up with a ~24x16 off cut which I kept.\n\nLast year we decided to stop using plastic cutting boards and reduced down to just the wood ones we had (one small, two large). We’ve struggled along since to keep up with them so this weekend I finally cut up the off cut in to a set of small, medium, large.\n\nIronically, I kept the plastic cutting boards to use as tooling such as holding wood boards while its conditioner sets.\n\nThis was my first time resawing with the table saw and first time using a router table. Definitely made some mistakes but learned a lot! Like how badly I want a band saw…"
  },
  {
    "title": "What sort of Finish should I use for this live edge cedar slab that will be an outdoor bench?",
    "author": "Gross_Wapo",
    "score": 1,
    "text": "Im making a Cedar bench for a friend of mine who owns a summer camp and im not sure which finish I should use as ive only recently started woodworking and there are so many finishes my head hurts. I want something which will ideally make the colors of the cedar itself pop but also last well outdoors."
  },
  {
    "title": "Fascia Board Bevel Cut",
    "author": "VinMuzzo",
    "score": 1,
    "text": "I am looking to attach trex fascia board around my deck perimeter, and I want to utilize a 45 degree bevel cut on my miter saw.\n\nI am not too familiar with this type of cut. Any tips or advice before doing so?\n\n"
  },
  {
    "title": "White Oak Nightstand Project – Learned a Lot, Thanks for the Feedback.",
    "author": "chrismcc45",
    "score": 149,
    "text": "Just finished my nightstand build, and I wanted to share the results! The cabinet is a folded slab of white oak, with ash drawer boxes and a figured white oak face.\n\nI haven’t made drawers before this point, so it was definitely a learning experience. Big thanks to everyone in this community who offered feedback and advice along the way, it made a huge difference.\n\nI’d love to hear what you think or what you might have done differently. I’m already thinking about doing a similar version using plywood to simplify the process a bit next time.\n\nAlways open to tips, tricks, and constructive feedback, thanks again for the support!"
  },
  {
    "title": "Console table finally finished",
    "author": "numberheadman",
    "score": 769,
    "text": "I finally finished my first console table. It took me a few months using what little spare time I have. I used reclaimed wood, milled them down with a table saw, but finished the joints with hand tools. It's also the first time I've done angles they weren't 90 degrees. It fits nicely behind our sectional so I finally have a place to set my whiskey... Only issue is my wife already posted up in the corner, and I'm not sure she'll ever leave.\n\nLet me know what you guys and gals think."
  },
  {
    "title": "Side mount Drawer Slides - Metric - pretty please help me?",
    "author": "Lakkkie",
    "score": 0,
    "text": "I need help, please! I keep on making a mess of my drawers, and it should be straight forward. I think the reason is that every single video i find online explaining drawer sizing and slides, are in inches and \"one eighth of an inch\" and measurements that my brain doesnt want to work with.  \nI use metric. Simple, easy, mm and cm. My brain says that logically, if i have a hole to which i want to add a drawer using side mount slides, the drawer should be the width of the hole less the thickness of 2 drawer slides (one for each side)  \nDrawers with side mount slides intimidate me. always have.   \nMy drawers NEVER fit. they are either too wide, and the slides dont work, or too narrow and there is a gap that i have to work around by adding spacers, which looks very ugly.  \nI am just about to give up and never build a single drawer again.   \nI know how to mount the drawer and attach the slides, i just dont know why i can never get the spacing on the sides right.   \nPlease, can some good human out there just tell me how many mm I need to make the drawer box smaller than the hole so that I can fit the drawer to slides? Normal ball bearing slides  that i do believe are standard in thickness everywhere. I believe it is 12.7mm thick each?  \nIs there a magical \"extra few mm\" that needs to come off / added back on that I dont know about? I can add photos, but i am too embarrassed at my latest abomination of a drawer.   \nSo if the \"hole is 400mm, the drawer box must be 400-12.7-12.7=374.6mm   \nwhat am i doing wrong?"
  },
  {
    "title": "Have you ever experienced kickback on the table saw? What happened and what did you learn from it?",
    "author": "relentless-rookie",
    "score": 19,
    "text": "Yesterday I posted about feeling anxious using my table saw (a Craftsman 113) even while taking all the usual safety precautions—splitter, push sticks, no freehand cuts, etc. The responses were super helpful and got me thinking more deeply about kickback in particular.\n\nI haven’t experienced it yet (and hope I never do), but I’ve read enough to know it’s one of the scariest and most common risks. Still, I feel like real-world examples—what caused it, what the setup was, and what people learned—would help drive the lessons home more than just reading safety articles or watching YouTube.\n\nTL;DR\nHave you ever had a kickback on the table saw? What were you doing, and what do you think caused it? What did you take away from the experience?\n\nHoping this thread can become something that helps other woodworkers avoid the same situations—or at least better understand the warning signs.\n\n"
  },
  {
    "title": "And Here I Thought my Miter Saw was my Safest tool. . .",
    "author": "Braided_Marxist",
    "score": 116,
    "text": "Now I finally understand the point of a zero clearance insert. Small offcut fell into the gap and bound the blade, breaking 2 teeth and sending them flying. \n\nDidn’t even realize how lucky I was until I saw a chunk of the metal fence gone "
  },
  {
    "title": "Hand cut dovetails I found are not so easy",
    "author": "charliesa5",
    "score": 179,
    "text": "People post \"my first hand cut dovetails\" on here. Either I'm slow, dumb, or both. I finally got a passable on after about 8 attempts."
  },
  {
    "title": "4 side bevel/miter table saw",
    "author": "Toddzilla89",
    "score": 2,
    "text": "I'm looking to make a \"stake\" with a pointed end. Normally I would use my miter saw and make 4, 45⁰ cuts to make a point.\n\nI am without my miter saw today I only have access to a jobsite table saw.\n\nIf im trying to make a point with 45s, am I better off using bevels or miters on the table saw?\n\nOr some other method totally different. \n\nThe only cutting tools I have is a table saw, jig saw and a circular saw.\n\nI feel like I have over thought this so much that I am confusing myself now lol.\n\nThanks!"
  },
  {
    "title": "What sort of flooring is this and can I darken the colour / get rid of scuffs on it?",
    "author": "Then-Structure-9524",
    "score": 1,
    "text": ""
  },
  {
    "title": "Question for merchants",
    "author": "MyCatIsAFknIdiot",
    "score": 1,
    "text": "I get how the rough sawn wood gets turned into the straight sides, but what about the “rounded” corners?\n\nHow does that happen?\n\nTotal noob, as you can tell "
  },
  {
    "title": "Picnic table top",
    "author": "CloudyGolfer",
    "score": 4,
    "text": "I built this picnic table in 2013. The pads are pressure treated lumber, the rest of the table is cedar. \n\nOver the last two years, the top of the table has been falling apart, with the wood basically rotting at the screws. The rest of the table is still holding together quite well. Stained once with Penofin red. \n\nIf I rebuild this, what should I look to change to prevent this from happening again? I assumed cedar was going to be the better option than using pressure treated given PT’s tendency to shrink and warp. "
  },
  {
    "title": "Whats the best aproach to adding a drawer onto my dining room table",
    "author": "AdmiralHornblower",
    "score": 1,
    "text": "I want to add sliding drawers to my dining room table. My thought was to cut out the lip of the table under the table and 3d print myself a drawer and drill it into place and drill the part of the table that I cut out onto the 3d printed piece. Also replace the braces I remove out with 3d prindted partes. My questions are.\n\nwhat tool should I use to cut the intial bit of wood?\n\nfor the drawers, can I 3d print the rails or should I buy a metal pair?\n\nhow thick should I make the drawer itself?\n\nthanks also question #4. is this stupid?"
  },
  {
    "title": "Cupped oak planks…",
    "author": "Acceptable-Lead5731",
    "score": 2,
    "text": "Hi all,\n\nHope I can get some help here.  I’m no woodworker or have a clue to be honest.  Basically I’m building a bench for some bonsai trees.  I’ve gone out and bought some oak planks just over 2 meters long 20cm wide, 5cm thick.  I’ve observed some crosswise warping in the wood, apparently called cupping.  For my desired design I just wanted to lay the planks on cinder blocks to create a bench.  Would it be better to place the boards with cupping facing upwards or downward.  I’m considering facing up, and sanding the high points.  Not sure if that’s the best way though.  I’m also now considering getting another plank to make 3 braces across on the underside to prevent any other warping.  The bracing boards would then sit on the cinder blocks.  I don’t have any specific equipment other than a sander.  Is my plan to nerf of some of the cupping high points a stupid on or should I just run with it !!!"
  },
  {
    "title": "outdoor planter box",
    "author": "Ok-Lingonberry990",
    "score": 17,
    "text": "***the picture above is not mine its an inspo picture i found on pinterest*** \n\nI’ve wanted to get into woodworking for a while and for my first project im looking into making these huge outdoor planter boxes and I have a few questions regarding this and would really appreciate any help at all!\n\n1. What type of wood should I use?\n2. Does it need a base for the bottom or can i just stab the wood into soil?\n3. What sizes are recommended?\n4. Is there any way to not drill it?\n5. Should I raise it or not? I don’t really know if it makes a difference but most of the planter boxes I’ve seen are raised. Is it just for the aesthetics or does it serve a purpose?\n6. Off topic but what should I plant?\n\nAlso I live in Malaysia and the weather here is really humid, it rains really often and its quite hot, in case that’s relevant.\n\n"
  },
  {
    "title": "Parkside electric/battery chainsaw",
    "author": "Dzuly91",
    "score": 1,
    "text": "Hey all!\n\nDoes anyone maybe own a Parkside chainsaw, the electric or battery one.\n\nI know that \"cheap is cheap\" and is not something I need very much, nor will use it from time to time, but its nice to not have to borrow it from someone else everytime. I will need it mostly for cutting random not-needed-anymore boards or thicker sticks. Should I go for Performance version?"
  },
  {
    "title": "Sheet sander. Should it be this slow?",
    "author": "kimptoc",
    "score": 7,
    "text": "Just got my first sander. However it does not seem to be sanding that fast. Barely doing anything. Maybe I am just impatient but thought it would be faster this. Trying to not press on it as per instructions. Also using coarse paper. \nThanks in advance for any advice. \nCheers, Chris "
  },
  {
    "title": "Jointing and stacking timber for planters.",
    "author": "fortunate_folly",
    "score": 14,
    "text": "Hey.\n\nApologies for the basic question but I've become lost in a sea of probably irrelevant variables. Some help in getting back on track would be super welcome.\n\nMy pile of scrap 'nearly useful' lengths of treated timber needs attention. There are only so many noggins one needs....I've a selection from 4x2 through to 6x2.\n\nI want to knock up a slightly more refined version of the boxes in the photo.  I can't decide the best way to join the boards on edge. \n\nKey criteria are:\n- Simplicity. I'm using construction timber and they are 'just' planters\n- Speed\n- Strength - able to survive the inevitable rigours of outdoor life. Moisture, temperature variations, weight.\n- Low maintenance.\n\nMy head is at:\n\n- Clamp and glue with PU adhesive. (Not convinced)\n- Clamp and glue but with biscuits (Not sure biscuits will add much to this scenario)\n- Dowels and glue\n- Screw and glue through bottom edge to keep fixings hidden. Ok for 4x2 stacks but 6x2??\n- Clamp and glue reinforced with dowels or pins running though almost full height.\n\nAny thoughts?\n\nThe boxes will be lined with a membrane then primed and finished with Tikkurila's wonderful Valti Opaque https://www.tikkurila.co.uk/valtti-opaque"
  },
  {
    "title": "I need help restoring this oak board please , UK based",
    "author": "Strict_Credit3148",
    "score": 0,
    "text": "What sort of oil/wax i should use pls , it costed me 400 pounds to buy !"
  },
  {
    "title": "Smart or dumb?",
    "author": "SilverHelp74",
    "score": 6,
    "text": "https://preview.redd.it/gu1gp4y3x90f1.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=b26911c571d08fa7a3ea0bb58f787429b89f9395\n\nhttps://preview.redd.it/wdu2z4h4x90f1.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=56df2cdc5bd00906d2370bda0b9ff07472dc175e\n\nI dunno if this is dumb of me or smart, but it does make it easy to line up the holes lol."
  },
  {
    "title": "Advice on how to fill this gap?",
    "author": "FleatWoodMacSexPants",
    "score": 1,
    "text": "First time using a router and it got away from me on my first few cuts. What’s the best way for me to fill this gap so that it can still be stained?\n\nIt’s Birch plywood. \n\nUnfortunately, starting over would mean remaking the entire coffee table… "
  },
  {
    "title": "Need some advice on a project…",
    "author": "Rain-Ancient",
    "score": 2,
    "text": "I have these two slabs from the same tree that I’m trying to turn into a bar. Each slab is about 12’ but I need a total length of 19’. I was thinking about joining them in the middle and filling the natural void with black epoxy. \n\nWhat’s the best way to join them so they’ll be stable? I was thinking dominos to line them up and wood glue them on the underside metal c-channels with threaded inserts so it has some structural support underneath? \n\nI’ve never joined slabs this way so no idea about the structural integrity… \n\n(Sorry for the crude drawing) "
  },
  {
    "title": "Floating shelves on textured walls",
    "author": "ignatzami",
    "score": 1,
    "text": "I have several floating shelves. Everything is square and level and I couldn’t be happier until I mount them on textured walls. Then the pins end up wonky and the shelves tilt.\n\nAny suggestions for small shims to help level things out?"
  },
  {
    "title": "Safety glasses with prescribed lenses?",
    "author": "mikhailkarasik",
    "score": 4,
    "text": "Can anybody recommend where can I get a good quality safety glasses with prescribed lenses? I'm in Canada, but US also works for me.\nAny place in Ottawa I asked requires me to sell my tools to afford."
  },
  {
    "title": "How can I make the padauk come out more on these coasters?",
    "author": "REAPER-OF-PRIDE",
    "score": 3,
    "text": "I made some coasters out of some scrap splattered walnut (may be wrong, can't remember what it was) and padauk. I was hoping for the padauk to be brighter Than what it is right now. Both have been cleaned with mineral oil but only the right has been stained (excluding the padauk) and tung oil finish applied. Is there anything I can do to help it come out more before I finalize it and move onto the rest of the coasters? "
  },
  {
    "title": "Pine door staining fiasco",
    "author": "970pringlesboy",
    "score": 2,
    "text": "Curious if anyone else has experienced this. We had some tiny little spouts of rain when we sanded these outside. It happened during the 220 grit phase. I thought nothing of it and we let the doors dry for 10 minutes then sanded down to 300. Doors sat inside all night and today we wiped them clean with a damp sponge, applied pre stain condition then stained them. \n\nThe raindrops are pretty appalling. I’m bummed since we spent some effort sanding these. I know my only reconnaissance is to sand and restain.\n\nAnybody ideas of what might have been in the rainwater that caused this?\n\nTwo pics, one of the door that is fucked. And another that was likely face down during the rain. Still not stellar staining job, but it’s pine. It’s hard"
  },
  {
    "title": "What causes these black spots on purpleheart?",
    "author": "Electrical-Okra7242",
    "score": 1,
    "text": "Curious what causes these black spots. This is from a cutting board I recently made, looks kinda cool but I wonder if it is food safe."
  },
  {
    "title": "Burning vs Stain/Sealer",
    "author": "Ok_Inflation_4427",
    "score": 1,
    "text": "Hi guys. I'm new to wood working and this was my first big project. Its a 12 foot table made with Pressure treated ground contact Southern Pine Timber. I want to give it the best chance of lasting a while and I'm seeking advice. What are the pros/cons on burning vs staining? I also attached a pic of the stain I was thinking of using. Thank you for the advice  "
  },
  {
    "title": "What would be the easiest way to make a cabinet pull/handle like this?",
    "author": "mrpoovegas",
    "score": 1,
    "text": "I'm planning on making a pull with a specific hole spacing because I've got a cabinet with a really odd measurement, but I'd love to swap the handles out for something nice.\n\nI'm a little out of practice with woodworking, but I have some hand tools and a drill, dremel: I don't own large powertools, but there's a tool library near me that rents bigger ones/bench tools out so I've technically got access to em, and I have a little bit of experience using bandsaws, routers, etc.\n\n-----------\n\nMy best guess for how to do this would be:\n\n- Cutting a blank to the general shape/size of the handle.\n\n- Drilling holes for the \"fitting\" bolts that'll go through the door into the back of the pull.\n\n- Maybe using a router to make the \"inset\" cutout.\nOR\n- Drilling through big enough to fit a hacksaw in to make the cutout. *(See the second pic)*\n\n- Then sanding off the edges to get the curve for the front.\n\n--------\n\nBut if anyone's got suggestions/a way that might be easier with minimal use of large powertools I'd love to hear it!"
  },
  {
    "title": "A gift for mother's day!",
    "author": "Horror-Assumption217",
    "score": 10,
    "text": "I've been wanting to get into woodworking for a while now, and for my first project, I decided to make a mailbox for my Mom. I used one cedar 1\"x8\"x8' for most of it, and an oak dowel for attaching the bottom to the walls. The hinges for the door, are hidden under the bottom. For the flag, I used some thin plywood I had lying around, and used a thin brass rod for it to pivot on. I managed to make quite a few non-lining up joints, but the only noticeable one was the top of the roof, for that I used a section of brass rod to turn it into an accent. And for all the bad joints, I used some caulk on the inside to seal them. For finish, I used some tung oil. For tools, I used all hand tools, with the exception of a power drill. Hope you guys like this, and I would appreciate all feedback."
  },
  {
    "title": "How many clamps do I need to keep for beginner woodworker",
    "author": "Kylipso",
    "score": 14,
    "text": "How many of these clamps should I realistically need to start basic woodworking (shelving, desks, organizers). Thanks for any assistance"
  },
  {
    "title": "How hard would it be to build an end grain cutting board like this?",
    "author": "Stopdropandcry352",
    "score": 0,
    "text": "Secondary question: How can I get that orange color on the side of the board?"
  },
  {
    "title": "How hard would it be to build an end grain cutting board like this",
    "author": "Stopdropandcry352",
    "score": 0,
    "text": "Also second question: how can I get that orange color in the side of the board?"
  },
  {
    "title": "Remember Your Early Builds? What Held It Together?",
    "author": "VariationCrafty61",
    "score": 2,
    "text": "Hey fellow woodworkers!\nI'm gearing up a bookshelf build, and it got me reminiscing.  I'm particularly interested in the experiences of the seasoned woodworkers here who might have started out with a more fundamental toolkit.\nThink back to that first bookshelf you built entirely on your own, before you had all the specialized joinery tools. When it came to attaching those shelves to the sides:\n * Did you primarily rely on nails and/or screws? If so, what techniques did you use to ensure a strong and presentable joint?\n * Did you employ methods like countersinking screws and filling the holes? What were your thoughts on the aesthetics and structural integrity of this approach?\n * What were some of the challenges you faced using these simpler methods, and how did you overcome them?\n * For someone tackling their very first bookshelf with a basic set of tools (saw, drill, hammer, screwdrivers), what would be your key advice for creating solid joints using primarily nails and screws? Any tips for achieving a decent look without advanced joinery?\nI'm keen to hear your stories about making strong and functional pieces with more basic techniques. Let's share some practical wisdom for those just starting out!\nThanks for your insights!"
  },
  {
    "title": "Used Boiled Linseed Oil on My Raised Garden Build — Can I Fix It for Food Safety?",
    "author": "Bizzy1995",
    "score": 0,
    "text": "I recently built a raised garden setup and saw a video where someone used boiled linseed oil on their wood, so I assumed it was food-safe and did the same. After applying it, I found out it’s not actually food-grade due to the chemical drying agents. Now I’m wondering — is there a way to safely coat over it with something food-safe so that it’s okay for vegetable leaves and stems to touch the wood? Would applying pure tung oil or some other topcoat help seal it and make it safe? Just looking for advice on how to salvage the build without starting over."
  },
  {
    "title": "Finally finished this beast",
    "author": "bearded_adventurer87",
    "score": 1,
    "text": "For my first time doing a project like this, I'm extremely happy with the final product. There are a couple minor things I wish I had done better, but you dont know what you dont know. While my other counter is more complex, I think it will go a bit better. I will have some questions when I get ready to do the next one, for now I just wanna woosah lol"
  },
  {
    "title": "New to making planters. I'm happy with the outcome, but will definitely make some changes next go around.",
    "author": "Vanishingastronaut",
    "score": 11,
    "text": ""
  },
  {
    "title": "Skil 15 amp 10” table saw cross cut sled recs",
    "author": "AllyPsych",
    "score": 1,
    "text": "Hi everyone! I recently bought the Skil 15amp 10” table saw (TS6307-00). \n\nI’ve already got a handful of the “essential” accessories (zero clearance, feather board, mitre gauge, push sticks and blocks). I’m looking to get a cross cut sled. Can someone point me in the direction of one that works well for my table saw?"
  },
  {
    "title": "Standard Picnic Table",
    "author": "Aggravating_Tea_5426",
    "score": 18,
    "text": "Completed second garage project using 2x4s and 2x6s. Found a free plan online, did make a couple slight errors, just don’t look at it too close 😅 applied first coat of stain (Cabot) and second will go on later this week!\n\n"
  },
  {
    "title": "How best to join these?",
    "author": "derpburer",
    "score": 1,
    "text": "What would be the best way to join the aprons together and to the legs? (2 pictures) Thanks."
  },
  {
    "title": "How to remove one quarter from the length of a wooden rod",
    "author": "universalsa",
    "score": 0,
    "text": "For a project (a sideboard) I need to remove one quarter of the length of a wooden rod to make it flush with a board. What is the easiest way to do this? Fixate it somehow and use a router? Is there an other way, since I don't have a router (but I guess I could buy one if it is the only way).\n\n"
  },
  {
    "title": "Uneven color - how to fix? How will it stain?",
    "author": "slipperyrope17",
    "score": 2,
    "text": "Got a pretty beat up console for free. Took off the old stain and sanded down with an orbital / hand sanding (admittedly quickly) just to see if I could get in in decent shape to stain. The color is pretty inconsistent - at times from my quick sanding and causing uneven depth probably? Or could there be other reasons? And how would this look if I stained? Trying to not put 8 more hours into a project piece so deciding if I cut my losses and just paint it. "
  },
  {
    "title": "Cedar Pickets - super green/wet",
    "author": "On-Second-Thought-23",
    "score": 0,
    "text": "https://preview.redd.it/ybd5okcso70f1.jpg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=bb739a8ca7588e56503a0678e0ff31f39ec664ce\n\nHey everyone! This is my very first planter build, I made it for my mom for Mother's Day. She loved it - however I am worried this thing is going to crack like crazy, as the wood was very wet when I made it yesterday. I used Titebond 3 + brad nails to assemble it. My questions are: 1) is it normal for cedar fence pickets to be that green? This was my first experience working with them - I bought them from Menards and pulled them off a pallet in the lumber yard and 2) should I plan to make another one for the inevitable day this one cracks? I also have 20 more pickets in my garage, as I was going to build more for our house and some other family members, so want to make sure I take proper steps before starting on those. Thanks for sharing your experience! "
  },
  {
    "title": "Oak planters made for wedding gifts… feedback appreciated.",
    "author": "Suspicious-Ad-8931",
    "score": 15,
    "text": ""
  },
  {
    "title": "How long to wait for stain before assembly",
    "author": "NorthAsk1560",
    "score": 1,
    "text": "I’m making a stereo cabinet out of birch plywood. I used masters wiping stain. Can says 10 hours to dry but it’s super sunny and windy today. It’s already dry to touch. Can I assemble the cabinet and let it finish curing? Or should I wait til tomorrow? "
  },
  {
    "title": "Introducing my new workbench, Murphy",
    "author": "LEdgar-Smith",
    "score": 122,
    "text": "I thought you all on this forum would be interested in the workbench. I just finished. Ladies and gentlemen meet Murphy.   The design that I followed is loosely based on this post (https://imgur.com/a/fold-down-work-bench-garage-work-shop-TWOuc), but includes more than a few adjustments.  \n\nI made the bench high enough that I could slide my tool chest underneath it when I wanted to, I also polyurethane the top and put a border around it to make it a little bit smoother when working up against it. I am Tremendously happy with the results. "
  },
  {
    "title": "It took literally the whole week, 600 screws, a few dozen miller lights, hours of creed and nickleback but the garden beds are finally built completely from scratch",
    "author": "Zombiesdying",
    "score": 959,
    "text": "No it’s not just held together with Brad nails lol\n"
  },
  {
    "title": "X- rated Bed frame question",
    "author": "WompaJody",
    "score": 574,
    "text": "Hello all, going to try and ask this as pg as I can. \n\nI have a friend who is into some 50-shades of gray stuff, and wants a bed that can be converted to max dirty, but then converted or discuised back to something more .. innocent looking when they aren’t using it. \n\nThe attached pic is what they sent me, as their idea. \n\nI’ve made bed frames for quick cheap bunkbeds for kids, out of 2x6 pine/doug fir. But never something higher end. \n\nWhat wood would you use for the 4x4 posts and panels.  \n\nMy plan on this one is essentially to leave the stockade pieces not permanently anchored, and able to be slid in/out through a dado on the columns, so the panels would be interchangeable with others, to perform the job of hiding the beds purpose.  "
  },
  {
    "title": "Discoloration after applying mineral oil to wood glue area.",
    "author": "kishan_326",
    "score": 7,
    "text": "There were numerous voids on this table top that I was able to fill with wood glue and sawdust. I sanded down these areas well after drying. It looked good, but after applying mineral oil, the areas we filled look very light.\n\nDoes anyone know why this is? Did we need to sand these areas more? I’m not sure why these spots aren’t affected the same way as the rest of the wood.\n\nAny tips would be appreciated!"
  },
  {
    "title": "Helped the kids make a scrap wood Wall-E pot holder for Mother’s Day.",
    "author": "ColonialSand-ers",
    "score": 164,
    "text": "My son saw one of these recently and really wanted to make it for Mother’s Day so yesterday we got to work. \n\nI started by drawing out the basic shapes and spray gluing them to a piece of basswood. \n\nThen I used the bandsaw to cut them to rough shapes. \n\nNext we broke out the Delta Bros to get everything sanded up. \n\nWe used a forstner bit to make depressions for the eyes. \n\nThen turned a scrap of basswood round for the next. I added a 0.5” tenon to connect to the body. \n\nI used a chunk of maple for the body to give it some weight to balance the pot. \n\nI cut a half lap into our neck dowel for the crossbar to hold the eyes to sit on. \n\nI used a piece of cherry for the platform and cut a depression in it with another forstner bit for the pot to rest in. \n\nFinally we connected everything up with glue and dowels. "
  }
]